# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
ser=pd.Series()
ser

<ipython-input-2-256366896314>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

Series([], dtype: float64)

In [3]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
ser=pd.Series([20,15.7,'10'])
ser

0      20
1    15.7
2      10
dtype: object

In [7]:
dict={'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}
print(pd.Series(dict))

A    [1, 2, 5]
B    [5, 8, 9]
C    [1, 2, 3]
dtype: object

In [8]:
print(pd.DataFrame(dict))

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [9]:
df=pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [10]:
df['States']="CA NV AZ".split()
df

   A  B  C States
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [19]:
dict={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df['States']="CA NV AZ".split()
df

     A    B  C States
0  1.0  5.0  1     CA
1  2.0  NaN  2     NV
2  NaN  NaN  3     AZ

In [14]:
print("\nDropping any column with a NaN value\n",'-'*35,sep='')
print(df.dropna(axis=1))
df

Dropping any column with a NaN value
-----------------------------------
   C States
0  1     CA
1  2     NV
2  3     AZ

     A    B  C States
0  1.0  5.0  1     CA
1  2.0  NaN  2     NV
2  NaN  NaN  3     AZ

In [18]:
print("\nFilling values with a default value\n",'-'*35,sep='')
print(df.fillna(value=10101010))
df

Filling values with a default value
-----------------------------------
   col1  col2  col3  FuncApplied
0     1   444   aaa          0.1
1     2   555    bb          0.2
2     3   666     c          0.3
3     4   444    dd          0.4
4     5   333  eeee          0.5
5     6   222   fff          0.6
6     7   666    gg          0.7
7     8   777     h          0.8
8     9   666   iii          0.9
9    10   555     j          1.0

   col1  col2  col3  FuncApplied
0     1   444   aaa          0.1
1     2   555    bb          0.2
2     3   666     c          0.3
3     4   444    dd          0.4
4     5   333  eeee          0.5
5     6   222   fff          0.6
6     7   666    gg          0.7
7     8   777     h          0.8
8     9   666   iii          0.9
9    10   555     j          1.0

In [ ]:
print("\nDropping any row with a NaN value\n",'-'*35,sep='')
print(df.dropna(axis=0))
df

In [ ]:
print("\nFilling values with a computed value(mean of a column A here)\n",'-'*60,sep='')
print(df.fillna(value=df['C'].mean(),inplace=True)) #inplace=True is used for store data parmenantly

In [28]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],\
     'Person':['Sam','Charlie','Amy','Vanessa','Car1','Sarah'],\
     'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Car1    243
5      FB    Sarah    350

In [29]:
byComp=df.groupby('Company')
print("\nGrouping by 'Company'column and listing mean sales\n",'-'*55,sep='')
print(byComp.mean())

Grouping by 'Company'column and listing mean sales
-------------------------------------------------------
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [30]:
print("\nGrouping by 'Company'column and listing sum of sales\n",'-'*55,sep='')
print(byComp.sum())

Grouping by 'Company'column and listing sum of sales
-------------------------------------------------------
         Sales
Company
FB         593
GOOG       320
MSFT       464

In [35]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3']},index=[0,1,2,3])

In [36]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7']},index=[4,5,6,7])

In [37]:
df_cat1=pd.concat([df1,df2],axis=0)
print("\nAfter concatenation along row\n")
print(df_cat1)

After concatenation along row

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [40]:
df_cat2=pd.concat([df1,df2],axis=1)
print("\nAfter concatenation along column\n")
print(df_cat2)

After concatenation along column

     A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7

In [41]:
df_cat2.fillna(value=0,inplace=True)
print("\nAfter filling missing values with zero\n")
print(df_cat2)

After filling missing values with zero

    A   B   C   A   B   C
0  A0  B0  C0   0   0   0
1  A1  B1  C1   0   0   0
2  A2  B2  C2   0   0   0
3  A3  B3  C3   0   0   0
4   0   0   0  A4  B4  C4
5   0   0   0  A5  B5  C5
6   0   0   0  A6  B6  C6
7   0   0   0  A7  B7  C7

In [42]:
df_cat2

    A   B   C   A   B   C
0  A0  B0  C0   0   0   0
1  A1  B1  C1   0   0   0
2  A2  B2  C2   0   0   0
3  A3  B3  C3   0   0   0
4   0   0   0  A4  B4  C4
5   0   0   0  A5  B5  C5
6   0   0   0  A6  B6  C6
7   0   0   0  A7  B7  C7

In [46]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A1','A2','A3','A4'],
                 'B':['B1','B2','B3','B4']
                 })

right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'C':['C1','C2','C3','C4'],
                 'D':['D1','D2','D3','D4']
                 })
print(left)
print("Right\n",right)

  key   A   B
0  K0  A1  B1
1  K1  A2  B2
2  K2  A3  B3
3  K3  A4  B4
Right
   key   C   D
0  K0  C1  D1
1  K1  C2  D2
2  K2  C3  D3
3  K3  C4  D4

In [47]:
merge1=pd.merge(left,right,how='inner',on='key')
print("\nAfter simple merging with 'inner method\n'")
print(merge1)

After simple merging with 'inner method
'
  key   A   B   C   D
0  K0  A1  B1  C1  D1
1  K1  A2  B2  C2  D2
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

In [48]:
left=pd.DataFrame({'A':['A1','A2','A3','A4'],
                 'B':['B1','B2','B3','B4']
                 },index=['K0','K1','K2','K3'])

right=pd.DataFrame({'C':['C1','C2','C3','C4'],
                 'D':['D1','D2','D3','D4']
                 },index=['K0','K4','K2','K3'])
print(left)
print("Right\n",right)

     A   B
K0  A1  B1
K1  A2  B2
K2  A3  B3
K3  A4  B4
Right
      C   D
K0  C1  D1
K4  C2  D2
K2  C3  D3
K3  C4  D4

In [49]:
left.join(right)

     A   B    C    D
K0  A1  B1   C1   D1
K1  A2  B2  NaN  NaN
K2  A3  B3   C3   D3
K3  A4  B4   C4   D4

In [50]:
left.join(right,how='outer')

      A    B    C    D
K0   A1   B1   C1   D1
K1   A2   B2  NaN  NaN
K2   A3   B3   C3   D3
K3   A4   B4   C4   D4
K4  NaN  NaN   C2   D2

In [7]:
def testfun(x):
    if(x>500):
        return (10*np.log10(x))
    else:
        return (x/10)

In [53]:
testfun(12)

1.2

In [3]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
               'col2':[444,555,666,444,333,222,666,777,666,555],
               'col3':['aaa','bb','c','dd','eeee','fff','gg','h','iii','j']})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [8]:
df['FuncApplied']=df['col1'].apply(testfun)
print(df)

   col1  col2  col3  FuncApplied
0     1   444   aaa          0.1
1     2   555    bb          0.2
2     3   666     c          0.3
3     4   444    dd          0.4
4     5   333  eeee          0.5
5     6   222   fff          0.6
6     7   666    gg          0.7
7     8   777     h          0.8
8     9   666   iii          0.9
9    10   555     j          1.0

In [9]:
df['col3len']=df['col3'].apply(len)
print(df)

   col1  col2  col3  FuncApplied  col3len
0     1   444   aaa          0.1        3
1     2   555    bb          0.2        2
2     3   666     c          0.3        1
3     4   444    dd          0.4        2
4     5   333  eeee          0.5        4
5     6   222   fff          0.6        3
6     7   666    gg          0.7        2
7     8   777     h          0.8        1
8     9   666   iii          0.9        3
9    10   555     j          1.0        1

In [58]:
df['FuncApplied'].apply(lambda x:np.sqrt(x))

0    0.316228
1    0.447214
2    0.547723
3    0.632456
4    0.707107
5    0.774597
6    0.836660
7    0.894427
8    0.948683
9    1.000000
Name: FuncApplied, dtype: float64

In [59]:
print("\nSum of the column 'FunApplied' is:",df['FuncApplied'].sum())

Sum of the column 'FunApplied' is: 5.5

In [60]:
print("min and max of the column 'FunApplied are:'",df['FuncApplied'].min(),"and",df['FuncApplied'].max())

min and max of the column 'FunApplied are:' 0.1 and 1.0

In [1]:
import pandas as pd
import numpy as np

In [10]:
print(df.columns)

Index(['col1', 'col2', 'col3', 'FuncApplied', 'col3len'], dtype='object')

In [12]:
l=list(df.columns)
print("\nColumn name s in a list of string for later manipulation",l)

Column name s in a list of string for later manipulation ['col1', 'col2', 'col3', 'FuncApplied', 'col3len']

In [15]:
del df['col3len']

In [16]:
df.sort_values(by='col2') #false by default

   col1  col2  col3  FuncApplied
5     6   222   fff          0.6
4     5   333  eeee          0.5
0     1   444   aaa          0.1
3     4   444    dd          0.4
1     2   555    bb          0.2
9    10   555     j          1.0
2     3   666     c          0.3
6     7   666    gg          0.7
8     9   666   iii          0.9
7     8   777     h          0.8

In [17]:
df.sort_values(by='FuncApplied',ascending=False)

   col1  col2  col3  FuncApplied
9    10   555     j          1.0
8     9   666   iii          0.9
7     8   777     h          0.8
6     7   666    gg          0.7
5     6   222   fff          0.6
4     5   333  eeee          0.5
3     4   444    dd          0.4
2     3   666     c          0.3
1     2   555    bb          0.2
0     1   444   aaa          0.1

In [23]:
df=pd.DataFrame({'col1':[1,2,np.nan,np.nan],
                'col2':[1,2,np.nan,45],
                'col3':[1,2,12,12.5],
                'col4':[1,2,np.nan,np.nan],
                'col5':[1,2,np.nan,np.nan],
                'col6':[1,2,np.nan,np.nan],
                'col7':[1,2,np.nan,np.nan],
                'col8':[1,2,np.nan,np.nan],
                'col9':[1,2,np.nan,np.nan],
                'col10':[1,2,np.nan,np.nan],
                 'col11':[1,2,np.nan,np.nan],
                'col12':[1,2,np.nan,np.nan]})
df

   col1  col2  col3  col4  col5  col6  col7  col8  col9  col10  col11  col12
0   1.0   1.0   1.0   1.0   1.0   1.0   1.0   1.0   1.0    1.0    1.0    1.0
1   2.0   2.0   2.0   2.0   2.0   2.0   2.0   2.0   2.0    2.0    2.0    2.0
2   NaN   NaN  12.0   NaN   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN
3   NaN  45.0  12.5   NaN   NaN   NaN   NaN   NaN   NaN    NaN    NaN    NaN

In [24]:
df.isnull().sum()  #count how many null in column

col1     2
col2     1
col3     0
col4     2
col5     2
col6     2
col7     2
col8     2
col9     2
col10    2
col11    2
col12    2
dtype: int64

# Load .csv file

In [27]:
ip=pd.read_csv(r'C:\Users\Lenovo\Desktop\matches.csv')

In [28]:
ip.tail(2)

   Id  season      City  date             Term1             Term2
8   9    2017  Banglore   NaN  Royal Challenger  Royal Challenger
9  10    2017     Delhi   NaN  Royal Challenger  Royal Challenger

In [30]:
ip.sample(n=3)  #it select random three data

   Id  season    City  date                  Term1                  Term2
0   1    2017    Pune   NaN       Royal Challenger       Royal Challenger
7   8    2017  Raipur   NaN       Royal Challenger       Royal Challenger
1   2    2017  Rajkot   NaN  Kolkata Knight Riders  Kolkata Knight Riders

In [31]:
type(ip)

pandas.core.frame.DataFrame

In [34]:
ip.shape  #use to count number of rows and columns

(10, 6)

# Exporting Data

In [36]:
ip.to_csv(r'C:\Users\Lenovo\Desktop\book1.csv',index=True,header=True)

# File Read Operation

In [43]:
excel_file=pd.read_excel(r'C:\Users\Lenovo\Desktop\Book1.xlsx',sheet_name='Sheet1')
excel_file

   Id  season      City  date                  Term1                  Term2
0   1    2017      Pune   NaN       Royal Challenger       Royal Challenger
1   2    2017    Rajkot   NaN  Kolkata Knight Riders  Kolkata Knight Riders
2   3    2017    Raipur   NaN       Royal Challenger       Royal Challenger
3   4    2017  Banglore   NaN       Royal Challenger       Royal Challenger
4   5    2017     Delhi   NaN  Kolkata Knight Riders  Kolkata Knight Riders
5   6    2017      Pune   NaN       Royal Challenger       Royal Challenger
6   7    2017    Rajkot   NaN       Royal Challenger       Royal Challenger
7   8    2017    Raipur   NaN       Royal Challenger       Royal Challenger
8   9    2017  Banglore   NaN       Royal Challenger       Royal Challenger
9  10    2017     Delhi   NaN       Royal Challenger       Royal Challenger

In [44]:
url="https://www.basketball-reference.com/leagues/NBA_wins.html"
BB_data=pd.read_html(url)

In [45]:
BB_data[0].head()

,Rk,Season,Lg,ATL,BOS,BRK,CHI,CHO,CLE,DAL,...,OKC,ORL,PHI,PHO,POR,SAC,SAS,TOR,UTA,WAS
0,1,2020-21,NBA,41,36,48,31,33,22,42,...,22,21,49,51,42,31,33,27,52,34
1,2,2019-20,NBA,20,48,35,22,23,19,43,...,44,33,43,34,35,31,32,53,44,25
2,3,2018-19,NBA,29,49,42,22,39,19,33,...,49,42,51,19,53,39,48,58,50,32
3,4,2017-18,NBA,24,55,28,27,36,50,24,...,48,25,52,21,49,27,47,59,48,43
4,5,2016-17,NBA,43,53,20,41,36,51,33,...,47,29,28,24,41,32,61,51,51,49

In [46]:
BB_data[0].columns

Index(['Rk', 'Season', 'Lg', 'ATL', 'BOS', 'BRK', 'CHI', 'CHO', 'CLE', 'DAL',
       'DEN', 'DET', 'GSW', 'HOU', 'IND', 'LAC', 'LAL', 'MEM', 'MIA', 'MIL',
       'MIN', 'NOP', 'NYK', 'OKC', 'ORL', 'PHI', 'PHO', 'POR', 'SAC', 'SAS',
       'TOR', 'UTA', 'WAS'],
      dtype='object')

In [48]:
BB_data[0].shape

(79, 33)

In [49]:
BB_data[0].columns

Index(['Rk', 'Season', 'Lg', 'ATL', 'BOS', 'BRK', 'CHI', 'CHO', 'CLE', 'DAL',
       'DEN', 'DET', 'GSW', 'HOU', 'IND', 'LAC', 'LAL', 'MEM', 'MIA', 'MIL',
       'MIN', 'NOP', 'NYK', 'OKC', 'ORL', 'PHI', 'PHO', 'POR', 'SAC', 'SAS',
       'TOR', 'UTA', 'WAS'],
      dtype='object')

In [58]:
BB_data[0][['Season','IND','BRK']].head()

     Season IND BRK
0   2020-21  34  48
..      ...  ..  ..
4   2016-17  42  20

[5 rows x 3 columns]

In [52]:
pd.options.display.max_rows=2

In [53]:
BB_data[0]

,Rk,Season,Lg,ATL,BOS,BRK,CHI,CHO,CLE,DAL,...,OKC,ORL,PHI,PHO,POR,SAC,SAS,TOR,UTA,WAS
0,1,2020-21,NBA,41,36,48,31,33,22,42,...,22,21,49,51,42,31,33,27,52,34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
78,NaN,Total,NaN,2807,3462,1533,2258,1083,1889,1657,...,2349,1212,2949,2271,2211,2624,2227,982,2060,2187